//Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное
//на само себя).

//Например:
//4 -> 16
//-3 -> 9
//-7 -> 49

int number = Convert.ToInt32(Console.ReadLine());
number = number * number;
Console.WriteLine("Your resalt is : " + number);
//or
//Console.WriteLine("Your {1} resalt is : {0}", number, text);
//or
//Console.WriteLine($"YoYour resalt is : " {function(formula))})

